In [12]:
import pandas as pd 
df=pd.read_csv(r"C:\Users\ibast\Downloads\bank\bank-full.csv",sep=';')

In [7]:
import pandas as pd
import numpy as np
from sklearn import preprocessing
import matplotlib.pyplot as plt 
from sklearn.linear_model import LogisticRegression
import seaborn as sns
plt.rc("font", size=14)
sns.set(style="white")
sns.set(style="whitegrid", color_codes=True)

In [13]:
df.head()

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
0,58,management,married,tertiary,no,2143,yes,no,unknown,5,may,261,1,-1,0,unknown,no
1,44,technician,single,secondary,no,29,yes,no,unknown,5,may,151,1,-1,0,unknown,no
2,33,entrepreneur,married,secondary,no,2,yes,yes,unknown,5,may,76,1,-1,0,unknown,no
3,47,blue-collar,married,unknown,no,1506,yes,no,unknown,5,may,92,1,-1,0,unknown,no
4,33,unknown,single,unknown,no,1,no,no,unknown,5,may,198,1,-1,0,unknown,no

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 45211 entries, 0 to 45210
Data columns (total 1 columns):
 #   Column                                                                                                                                                Non-Null Count  Dtype
---  ------                                                                                                                                                --------------  -----
 0   age;"job";"marital";"education";"default";"balance";"housing";"loan";"contact";"day";"month";"duration";"campaign";"pdays";"previous";"poutcome";"y"  45211 non-null  object
dtypes: object(1)
memory usage: 353.3+ KB

In [26]:
df["education"].unique()

array(['tertiary', 'secondary', 'unknown', 'primary'], dtype=object)

In [29]:
df.groupby["education"].mean()

TypeError: 'method' object is not subscriptable

In [24]:
pd.get_dummies(df["education"])

       primary  secondary  tertiary  unknown
0            0          0         1        0
1            0          1         0        0
2            0          1         0        0
3            0          0         0        1
4            0          0         0        1
...        ...        ...       ...      ...
45206        0          0         1        0
45207        1          0         0        0
45208        0          1         0        0
45209        0          1         0        0
45210        0          1         0        0

[45211 rows x 4 columns]

In [17]:
df.shape

(45211, 17)

In [18]:
help(np,where)

NameError: name 'where' is not defined

In [ ]:
pd.get_dummies(df["education"],drop_first=True)

In [ ]:
df_dummy=pd.get_dummies(df["education"],drop_first=True)
df_dummy.head()

In [ ]:
#now drop starte column
new_df=df.drop("education",axis=1)

In [ ]:
df=pd.concat([new_df,df_dummy],axis=1)
df.